#+TITLE: python 入门讲义 第一讲
#+PROPERTY:  results output

** 函数
#+begin_src python :exports both
  def add(a, b, c=0):  # 可以指定形参的默认值
      return (a + b + c)


  print(add(1, 2))
  print(add(1, 2, 3))
#+end_src

#+RESULTS:
: 3
: 6

** 使用 ~.~ 来操作对象
#+begin_src python :session list
  # 插入到末尾
  a.append(233)
  # 把列表中的元素插入到末尾
  a.extend([7, 5, 4, 3])
  # 任何元素都可以转换成字符串，可以用 %s 来指代
  # 只有一个元素的时候可以不加括号
  print("a: %s" % a)

  # 把某个元素插入到指定位置
  b.insert(2, '"(ºДº*)')
  # 删除某个元素，省略参数时删除第一个
  b.pop(1)
  # 逆序排列
  b.reverse()
  # 排序
  a.sort()

  # 列表中的元素是引用哦，但是 c 是复制出来的，不会随 b 改变
  print(d)
#+end_src

#+BEGIN_EXAMPLE
a: [233, 7, 5, 4, 3]
[[3, 4, 5, 7, 233], [8, 50, '"( Д *)', 5], [5, 6, 50, 8], 666]
#+END_EXAMPLE

#+begin_src python :exports both
  a = ['c', "a", 'b', 'c', 'd']
  # 返回某元素的索引
  print(a.index('c'))
  # 移除第一个指定的元素
  a.remove('c')
  print(a)
#+end_src

#+RESULTS:
: 0
: ['a', 'b', 'c', 'd']

** 某些特殊语句
#+begin_src python :exports both
  a = [1, 2, 3, 4]
  print(a[3])
  # 列表中 [1,2) 区间里的元素组成的新列表
  print(a[1:2])
  """
  如果留空，左边界默认为 0，右边界默认为长度
  可以使用负数来反向索引
  使用 o[:] 这样的形式可以拷贝整个列表
      ○ 可以使用第三个参数表示步长，如：L[i:j:k]。默认为 1
      ○ 如果是负数，则表示从右往左扫描，此时前两个参数的含义表示从右往左
      时的“终止点：起始点”
  """
  s = 'abcdefg'  # 字符串也是一个序列
  print(s[5:1:-1])

  # 负数表示从后往前索引
  print(s[-1])

  # 用加号来连接两个列表
  print(a + a[:2])

  # 给列表赋值可以改变它
  lst = [1, 2, 3]
  lst[:1] = [6, 6, 6]
  print(lst)
#+end_src

#+RESULTS:
: 4
: [2]
: fedc
: g
: [1, 2, 3, 4, 1, 2]
: [6, 6, 6, 2, 3]

del 可以删除某个元素
#+begin_src python :exports both
  a = [1, 2, 3, 4]
  del a[0]
  print(a)
  a = [1, 2, 3, 4]
  del a[1:]
  # a[1:] = [] 也有同样的效果
  print(a)
#+end_src

#+RESULTS:
: [2, 3, 4]
: [1]

in 可以测试某个元素是否在列表中（其实还有很多类型可以这样检测）
#+begin_src python :exports both
  lst = ['a', 'b', 'c']
  print('a' in lst)
  print('d' not in lst)
#+end_src

#+RESULTS:
: True
: True
** 字符串的方法
#+begin_src python :exports both
  s = "a bc d e"
  # 将字符串从空格处分开，返回一个列表
  print(s.split())
  # 可以指定分隔符，第二个参数是最多分割多少次
  print(s.split('d'))
  # 参数传递的另一种方式：指定形参的名字
  print(s.split(maxsplit=1))
#+end_src

#+RESULTS:
: ['a', 'bc', 'd', 'e']
: ['a bc ', ' e']
: ['a', 'bc d e']

#+begin_src python :exports both
  s = "abcde"
  # 返回某子串第一次出现的位置
  print(s.find('b'))
  # 找不到时返回 -1
  print(s.find('NO!!!'))
#+end_src

#+RESULTS:
: 1
: -1

#+begin_src python :exports both
  s = 'very longgggggggggggggggggggg'
  # 内置函数 len 可以返回长度，可以用在多种类型上，包括列表
  print(len(s))
#+end_src

#+RESULTS:
: 29

